iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct I2SC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t CKEN:1;
      uint64_t CKDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t DATALENGTH:3;
      uint64_t reservedSpace1:3;
      uint64_t RXMONO:1;
      uint64_t RXDMA:1;
      uint64_t RXLOOP:1;
      uint64_t reservedSpace2:1;
      uint64_t TXMONO:1;
      uint64_t TXDMA:1;
      uint64_t TXSAME:1;
      uint64_t reservedSpace3:1;
      uint64_t IMCKDIV:6;
      uint64_t reservedSpace4:2;
      uint64_t IMCKFS:6;
      uint64_t IMCKMODE:1;
      uint64_t IWS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t TXEN:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t RXORCH:2;
      uint64_t reservedSpace0:9;
      uint64_t RXBUFF:1;
      uint64_t TXURCH:2;
      uint64_t reservedSpace1:9;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RXOR:1;
      uint64_t reservedSpace1:3;
      uint64_t TXUR:1;
      uint64_t reservedSpace2:1;
      uint64_t RXORCH:2;
      uint64_t reservedSpace3:10;
      uint64_t TXURCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RXOR:1;
      uint64_t reservedSpace1:3;
      uint64_t TXUR:1;
      uint64_t reservedSpace2:1;
      uint64_t RXORCH:2;
      uint64_t reservedSpace3:10;
      uint64_t TXURCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_SSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t reservedSpace1:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t reservedSpace2:11;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:11;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t reservedSpace1:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t reservedSpace2:11;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:11;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t reservedSpace1:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t reservedSpace2:11;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:11;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RHR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_THR;

  uint8_t res0[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t RXCBEN:1;
      uint64_t RXCBDIS:1;
      uint64_t TXCBEN:1;
      uint64_t TXCBDIS:1;
      uint64_t reservedSpace2:4;
      uint64_t ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t RXCBEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TXCBEN:1;
      uint64_t reservedSpace3:5;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC0_PTSR;

