iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
};

#define I2SC0 (*(volatile struct I2SC0_tag *) 0x40000000)

struct I2SC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t CKEN:1;
      uint64_t CKDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t DATALENGTH:3;
      uint64_t reservedSpace1:3;
      uint64_t RXMONO:1;
      uint64_t RXDMA:1;
      uint64_t RXLOOP:1;
      uint64_t reservedSpace2:1;
      uint64_t TXMONO:1;
      uint64_t TXDMA:1;
      uint64_t TXSAME:1;
      uint64_t reservedSpace3:1;
      uint64_t IMCKDIV:6;
      uint64_t reservedSpace4:2;
      uint64_t IMCKFS:6;
      uint64_t IMCKMODE:1;
      uint64_t IWS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t TXEN:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t RXORCH:2;
      uint64_t reservedSpace0:9;
      uint64_t RXBUFF:1;
      uint64_t TXURCH:2;
      uint64_t reservedSpace1:9;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RXOR:1;
      uint64_t reservedSpace1:3;
      uint64_t TXUR:1;
      uint64_t reservedSpace2:1;
      uint64_t RXORCH:2;
      uint64_t reservedSpace3:10;
      uint64_t TXURCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RXOR:1;
      uint64_t reservedSpace1:3;
      uint64_t TXUR:1;
      uint64_t reservedSpace2:1;
      uint64_t RXORCH:2;
      uint64_t reservedSpace3:10;
      uint64_t TXURCH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_SSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t reservedSpace1:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t reservedSpace2:11;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:11;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t reservedSpace1:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t reservedSpace2:11;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:11;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXRDY:1;
      uint64_t RXOR:1;
      uint64_t ENDRX:1;
      uint64_t reservedSpace1:1;
      uint64_t TXRDY:1;
      uint64_t TXUR:1;
      uint64_t ENDTX:1;
      uint64_t reservedSpace2:11;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:11;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RHR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_THR;

  uint8_t res0[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t RXCBEN:1;
      uint64_t RXCBDIS:1;
      uint64_t TXCBEN:1;
      uint64_t TXCBDIS:1;
      uint64_t reservedSpace2:4;
      uint64_t ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t RXCBEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TXCBEN:1;
      uint64_t reservedSpace3:5;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SC1_PTSR;

};

#define I2SC1 (*(volatile struct I2SC1_tag *) 0x40004000)

struct SPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIEN:1;
      uint64_t SPIDIS:1;
      uint64_t reservedSpace0:5;
      uint64_t SWRST:1;
      uint64_t reservedSpace1:16;
      uint64_t LASTXFER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR:1;
      uint64_t PS:1;
      uint64_t PCSDEC:1;
      uint64_t reservedSpace0:1;
      uint64_t MODFDIS:1;
      uint64_t WDRBT:1;
      uint64_t reservedSpace1:1;
      uint64_t LLB:1;
      uint64_t reservedSpace2:8;
      uint64_t PCS:4;
      uint64_t reservedSpace3:4;
      uint64_t DLYBCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:16;
      uint64_t PCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:16;
      uint64_t PCS:4;
      uint64_t reservedSpace0:4;
      uint64_t LASTXFER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_TDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
      uint64_t reservedSpace0:5;
      uint64_t SPIENS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDRF:1;
      uint64_t TDRE:1;
      uint64_t MODF:1;
      uint64_t OVRES:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t NSSR:1;
      uint64_t TXEMPTY:1;
      uint64_t UNDES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_IMR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOL:1;
      uint64_t NCPHA:1;
      uint64_t CSNAAT:1;
      uint64_t CSAAT:1;
      uint64_t BITS:4;
      uint64_t SCBR:8;
      uint64_t DLYBS:8;
      uint64_t DLYBCT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CSR_3;

  uint8_t res1[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_WPSR;

