iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t RXCBEN:1;
      uint64_t RXCBDIS:1;
      uint64_t TXCBEN:1;
      uint64_t TXCBDIS:1;
      uint64_t reservedSpace2:4;
      uint64_t ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t RXCBEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TXCBEN:1;
      uint64_t reservedSpace3:5;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_PTSR;

};

#define SPI (*(volatile struct SPI_tag *) 0x40008000)

struct TWI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t MSEN:1;
      uint64_t MSDIS:1;
      uint64_t SVEN:1;
      uint64_t SVDIS:1;
      uint64_t QUICK:1;
      uint64_t SWRST:1;
      uint64_t HSEN:1;
      uint64_t HSDIS:1;
      uint64_t SMBEN:1;
      uint64_t SMBDIS:1;
      uint64_t PECEN:1;
      uint64_t PECDIS:1;
      uint64_t PECRQ:1;
      uint64_t CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t IADRSZ:2;
      uint64_t reservedSpace1:2;
      uint64_t MREAD:1;
      uint64_t reservedSpace2:3;
      uint64_t DADR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_MMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NACKEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SMDA:1;
      uint64_t SMHH:1;
      uint64_t reservedSpace1:2;
      uint64_t SCLWSDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t MASK:7;
      uint64_t reservedSpace3:1;
      uint64_t SADR:7;
      uint64_t reservedSpace4:5;
      uint64_t SADR1EN:1;
      uint64_t SADR2EN:1;
      uint64_t SADR3EN:1;
      uint64_t DATAMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_SMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADR:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_IADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLDIV:8;
      uint64_t CHDIV:8;
      uint64_t CKDIV:3;
      uint64_t reservedSpace0:5;
      uint64_t HOLD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_CWGR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCOMP:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t SVREAD:1;
      uint64_t SVACC:1;
      uint64_t GACC:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
      uint64_t NACK:1;
      uint64_t ARBLST:1;
      uint64_t SCLWS:1;
      uint64_t EOSACC:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t MCACK:1;
      uint64_t reservedSpace0:1;
      uint64_t TOUT:1;
      uint64_t PECERR:1;
      uint64_t SMBDAM:1;
      uint64_t SMBHHM:1;
      uint64_t reservedSpace1:2;
      uint64_t SCL:1;
      uint64_t SDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCOMP:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t SVACC:1;
      uint64_t GACC:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
      uint64_t NACK:1;
      uint64_t ARBLST:1;
      uint64_t SCL_WS:1;
      uint64_t EOSACC:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t MCACK:1;
      uint64_t reservedSpace1:1;
      uint64_t TOUT:1;
      uint64_t PECERR:1;
      uint64_t SMBDAM:1;
      uint64_t SMBHHM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCOMP:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t SVACC:1;
      uint64_t GACC:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
      uint64_t NACK:1;
      uint64_t ARBLST:1;
      uint64_t SCL_WS:1;
      uint64_t EOSACC:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t MCACK:1;
      uint64_t reservedSpace1:1;
      uint64_t TOUT:1;
      uint64_t PECERR:1;
      uint64_t SMBDAM:1;
      uint64_t SMBHHM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCOMP:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t SVACC:1;
      uint64_t GACC:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
      uint64_t NACK:1;
      uint64_t ARBLST:1;
      uint64_t SCL_WS:1;
      uint64_t EOSACC:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t RXBUFF:1;
      uint64_t TXBUFE:1;
      uint64_t MCACK:1;
      uint64_t reservedSpace1:1;
      uint64_t TOUT:1;
      uint64_t PECERR:1;
      uint64_t SMBDAM:1;
      uint64_t SMBHHM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESC:4;
      uint64_t reservedSpace0:4;
      uint64_t TLOWS:8;
      uint64_t TLOWM:8;
      uint64_t THMAX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWI0_SMBTR;

