iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
  uint8_t res2[132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_WPSR;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_RCR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_RNCR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t RXCBEN:1;
      uint64_t RXCBDIS:1;
      uint64_t TXCBEN:1;
      uint64_t TXCBDIS:1;
      uint64_t reservedSpace2:4;
      uint64_t ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t RXCBEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TXCBEN:1;
      uint64_t reservedSpace3:5;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC0_PTSR;

};

#define PDMIC0 (*(volatile struct PDMIC0_tag *) 0x4002c000)

struct PDMIC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t reservedSpace0:3;
      uint64_t ENPDM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PRESCAL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_MR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t DRDY:1;
      uint64_t OVRE:1;
      uint64_t reservedSpace1:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t DRDY:1;
      uint64_t OVRE:1;
      uint64_t reservedSpace1:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t DRDY:1;
      uint64_t OVRE:1;
      uint64_t reservedSpace1:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t FIFOCNT:8;
      uint64_t DRDY:1;
      uint64_t OVRE:1;
      uint64_t reservedSpace1:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_ISR;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t HPFBYP:1;
      uint64_t SINBYP:1;
      uint64_t SIZE:1;
      uint64_t OSR:3;
      uint64_t reservedSpace1:1;
      uint64_t SCALE:4;
      uint64_t SHIFT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_DSPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DGAIN:15;
      uint64_t reservedSpace0:1;
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_DSPR1;

  uint8_t res2[132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_WPSR;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_RCR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_RNCR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t RXCBEN:1;
      uint64_t RXCBDIS:1;
      uint64_t TXCBEN:1;
      uint64_t TXCBDIS:1;
      uint64_t reservedSpace2:4;
      uint64_t ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t RXCBEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TXCBEN:1;
      uint64_t reservedSpace3:5;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDMIC1_PTSR;

