iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
};

#define PDMIC1 (*(volatile struct PDMIC1_tag *) 0x40030000)

struct ADC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGEN:1;
      uint64_t TRGSEL:3;
      uint64_t LOWRES:1;
      uint64_t SLEEP:1;
      uint64_t reservedSpace0:1;
      uint64_t FREERUN:1;
      uint64_t PRESCAL:8;
      uint64_t STARTUP:4;
      uint64_t reservedSpace1:2;
      uint64_t DIV1:1;
      uint64_t reservedSpace2:1;
      uint64_t TRACKTIM:4;
      uint64_t TRANSFER:2;
      uint64_t DIV3:1;
      uint64_t USEQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USCH1:4;
      uint64_t USCH2:4;
      uint64_t USCH3:4;
      uint64_t USCH4:4;
      uint64_t USCH5:4;
      uint64_t USCH6:4;
      uint64_t USCH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_SEQR1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CHSR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDATA:12;
      uint64_t CHNB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_LCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t reservedSpace0:11;
      uint64_t LCCHG:1;
      uint64_t reservedSpace1:4;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t reservedSpace0:11;
      uint64_t LCCHG:1;
      uint64_t reservedSpace1:4;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t reservedSpace0:11;
      uint64_t LCCHG:1;
      uint64_t reservedSpace1:4;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t reservedSpace0:11;
      uint64_t LCCHG:1;
      uint64_t reservedSpace1:4;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUALTRIG:1;
      uint64_t reservedSpace0:3;
      uint64_t CMPMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_LCTMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWTHRES:12;
      uint64_t reservedSpace0:4;
      uint64_t HIGHTHRES:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_LCCWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRE0:1;
      uint64_t OVRE1:1;
      uint64_t OVRE2:1;
      uint64_t OVRE3:1;
      uint64_t OVRE4:1;
      uint64_t OVRE5:1;
      uint64_t OVRE6:1;
      uint64_t OVRE7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_OVER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMODE:2;
      uint64_t reservedSpace0:2;
      uint64_t CMPSEL:4;
      uint64_t reservedSpace1:1;
      uint64_t CMPALL:1;
      uint64_t reservedSpace2:2;
      uint64_t CMPFILTER:2;
      uint64_t reservedSpace3:2;
      uint64_t OSR:2;
      uint64_t reservedSpace4:2;
      uint64_t ASTE:1;
      uint64_t reservedSpace5:3;
      uint64_t TAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_EMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWTHRES:12;
      uint64_t reservedSpace0:4;
      uint64_t HIGHTHRES:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CWR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_7;

  uint8_t res3[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_WPSR;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RCR;

