iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTEN:1;
      uint64_t MOSCXTBY:1;
      uint64_t WAITMODE:1;
      uint64_t MOSCRCEN:1;
      uint64_t MOSCRCF:3;
      uint64_t reservedSpace0:1;
      uint64_t MOSCXTST:8;
      uint64_t KEY:8;
      uint64_t MOSCSEL:1;
      uint64_t CFDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_MOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINF:16;
      uint64_t MAINFRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t RCMEAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_MCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLAEN:8;
      uint64_t PLLACOUNT:6;
      uint64_t reservedSpace0:2;
      uint64_t MULA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_PLLAR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:2;
      uint64_t reservedSpace0:2;
      uint64_t PRES:3;
      uint64_t reservedSpace1:5;
      uint64_t PLLADIV2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_MCKR;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCK_2;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:4;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace2:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:4;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace2:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:3;
      uint64_t OSCSELS:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace2:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
      uint64_t CFDS:1;
      uint64_t FOS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:4;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t PCKRDY2:1;
      uint64_t reservedSpace2:5;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSTT0:1;
      uint64_t FSTT1:1;
      uint64_t FSTT2:1;
      uint64_t FSTT3:1;
      uint64_t FSTT4:1;
      uint64_t FSTT5:1;
      uint64_t FSTT6:1;
      uint64_t FSTT7:1;
      uint64_t FSTT8:1;
      uint64_t FSTT9:1;
      uint64_t FSTT10:1;
      uint64_t FSTT11:1;
      uint64_t FSTT12:1;
      uint64_t FSTT13:1;
      uint64_t FSTT14:1;
      uint64_t FSTT15:1;
      uint64_t RTTAL:1;
      uint64_t RTCAL:1;
      uint64_t reservedSpace0:2;
      uint64_t LPM:1;
      uint64_t FLPM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_FSMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSTP0:1;
      uint64_t FSTP1:1;
      uint64_t FSTP2:1;
      uint64_t FSTP3:1;
      uint64_t FSTP4:1;
      uint64_t FSTP5:1;
      uint64_t FSTP6:1;
      uint64_t FSTP7:1;
      uint64_t FSTP8:1;
      uint64_t FSTP9:1;
      uint64_t FSTP10:1;
      uint64_t FSTP11:1;
      uint64_t FSTP12:1;
      uint64_t FSTP13:1;
      uint64_t FSTP14:1;
      uint64_t FSTP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_FSPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FOCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_FOCR;

  uint8_t res5[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_WPSR;

  uint8_t res6[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL8:7;
      uint64_t SEL8:1;
      uint64_t CAL16:7;
      uint64_t SEL16:1;
      uint64_t CAL24:7;
      uint64_t SEL24:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_OCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SLPWK_ER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SLPWK_DR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SLPWK_SR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SLPWK_ASR0;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLA_MMAX:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PMMR;

