iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
};

#define CHIPID (*(volatile struct CHIPID_tag *) 0x400e0740)

struct UART1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSTRX:1;
      uint64_t RSTTX:1;
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t RSTSTA:1;
      uint64_t reservedSpace1:3;
      uint64_t REQCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t FILTER:1;
      uint64_t reservedSpace1:4;
      uint64_t PAR:3;
      uint64_t reservedSpace2:2;
      uint64_t CHMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_BRGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL1:8;
      uint64_t reservedSpace0:4;
      uint64_t CMPMODE:1;
      uint64_t reservedSpace1:1;
      uint64_t CMPPAR:1;
      uint64_t reservedSpace2:1;
      uint64_t VAL2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_CMPR;

  uint8_t res0[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_WPMR;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t RXCBEN:1;
      uint64_t RXCBDIS:1;
      uint64_t TXCBEN:1;
      uint64_t TXCBDIS:1;
      uint64_t reservedSpace2:4;
      uint64_t ERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t RXCBEN:1;
      uint64_t reservedSpace2:1;
      uint64_t TXCBEN:1;
      uint64_t reservedSpace3:5;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_PTSR;

};

#define UART1 (*(volatile struct UART1_tag *) 0x400e0800)

struct EFC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t FWS:4;
      uint64_t reservedSpace1:4;
      uint64_t SCOD:1;
      uint64_t reservedSpace2:7;
      uint64_t FAM:1;
      uint64_t reservedSpace3:1;
      uint64_t CLOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFC_FMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMD:8;
      uint64_t FARG:16;
      uint64_t FKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFC_FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDY:1;
      uint64_t FCMDE:1;
      uint64_t FLOCKE:1;
      uint64_t FLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFC_FSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FVALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFC_FRR;

