iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMG53/emptyTargetInit/SAMG53_sfr.h
};

#define PIOB (*(volatile struct PIOB_tag *) 0x400e1000)

struct RSTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCRST:1;
      uint64_t reservedSpace0:1;
      uint64_t PERRST:1;
      uint64_t EXTRST:1;
      uint64_t reservedSpace1:20;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t URSTS:1;
      uint64_t reservedSpace0:7;
      uint64_t RSTTYP:3;
      uint64_t reservedSpace1:5;
      uint64_t NRSTL:1;
      uint64_t SRCMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t URSTEN:1;
      uint64_t reservedSpace0:3;
      uint64_t URSTIEN:1;
      uint64_t reservedSpace1:3;
      uint64_t ERSTL:4;
      uint64_t reservedSpace2:12;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTC_MR;

};

#define RSTC (*(volatile struct RSTC_tag *) 0x400e1400)

struct SUPC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ZERO:1;
      uint64_t XTALSEL:1;
      uint64_t reservedSpace1:20;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMTH:4;
      uint64_t reservedSpace0:4;
      uint64_t SMSMPL:3;
      uint64_t reservedSpace1:1;
      uint64_t SMRSTEN:1;
      uint64_t SMIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPC_SMMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t BODRSTEN:1;
      uint64_t BODDIS:1;
      uint64_t reservedSpace1:6;
      uint64_t OSCBYPASS:1;
      uint64_t PSWITCH0:1;
      uint64_t PSWITCH1:1;
      uint64_t PSWITCH2:1;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPC_MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t BODRSTS:1;
      uint64_t SMRSTS:1;
      uint64_t SMS:1;
      uint64_t SMOS:1;
      uint64_t OSCSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPC_SR;

};

#define SUPC (*(volatile struct SUPC_tag *) 0x400e1410)

struct RTT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTPRES:16;
      uint64_t ALMIEN:1;
      uint64_t RTTINCIEN:1;
      uint64_t RTTRST:1;
      uint64_t reservedSpace0:1;
      uint64_t RTTDIS:1;
      uint64_t reservedSpace1:3;
      uint64_t RTC1HZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTT_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTT_AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRTV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTT_VR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMS:1;
      uint64_t RTTINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTT_SR;

};

#define RTT (*(volatile struct RTT_tag *) 0x400e1430)

struct WDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDRSTT:1;
      uint64_t reservedSpace0:23;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDV:12;
      uint64_t WDFIEN:1;
      uint64_t WDRSTEN:1;
      uint64_t WDRPROC:1;
      uint64_t WDDIS:1;
      uint64_t WDD:12;
      uint64_t WDDBGHLT:1;
      uint64_t WDIDLEHLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDUNF:1;
      uint64_t WDERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_SR;

};

#define WDT (*(volatile struct WDT_tag *) 0x400e1450)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPDTIM:1;
      uint64_t UPDCAL:1;
      uint64_t reservedSpace0:6;
      uint64_t TIMEVSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t CALEVSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRMOD:1;
      uint64_t PERSIAN:1;
      uint64_t reservedSpace0:2;
      uint64_t NEGPPM:1;
      uint64_t reservedSpace1:3;
      uint64_t CORRECTION:7;
      uint64_t HIGHPPM:1;
      uint64_t OUT0:3;
      uint64_t reservedSpace2:1;
      uint64_t OUT1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:7;
      uint64_t reservedSpace0:1;
      uint64_t MIN:7;
      uint64_t reservedSpace1:1;
      uint64_t HOUR:6;
      uint64_t AMPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENT:7;
      uint64_t reservedSpace0:1;
      uint64_t YEAR:8;
      uint64_t MONTH:5;
      uint64_t DAY:3;
      uint64_t DATE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:7;
      uint64_t SECEN:1;
      uint64_t MIN:7;
      uint64_t MINEN:1;
      uint64_t HOUR:6;
      uint64_t AMPM:1;
      uint64_t HOUREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TIMALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MONTH:5;
      uint64_t reservedSpace1:2;
      uint64_t MTHEN:1;
      uint64_t DATE:6;
      uint64_t reservedSpace2:1;
      uint64_t DATEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CALALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKUPD:1;
      uint64_t ALARM:1;
      uint64_t SEC:1;
      uint64_t TIMEV:1;
      uint64_t CALEV:1;
      uint64_t TDERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKCLR:1;
      uint64_t ALRCLR:1;
      uint64_t SECCLR:1;
      uint64_t TIMCLR:1;
      uint64_t CALCLR:1;
      uint64_t TDERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_SCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKEN:1;
      uint64_t ALREN:1;
      uint64_t SECEN:1;
      uint64_t TIMEN:1;
      uint64_t CALEN:1;
      uint64_t TDERREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKDIS:1;
      uint64_t ALRDIS:1;
      uint64_t SECDIS:1;
      uint64_t TIMDIS:1;
      uint64_t CALDIS:1;
      uint64_t TDERRDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACK:1;
      uint64_t ALR:1;
      uint64_t SEC:1;
      uint64_t TIM:1;
      uint64_t CAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NVTIM:1;
      uint64_t NVCAL:1;
      uint64_t NVTIMALR:1;
      uint64_t NVCALALR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_VER;

};

#define RTC (*(volatile struct RTC_tag *) 0x400e1460)

struct GPBR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBR_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBR_GPBR_7;

};

#define GPBR (*(volatile struct GPBR_tag *) 0x400e1490)

